<?php
	require( 'function.php' );
	
	$year	= date( 'Y' );
	$title	= 'Произвольный заголовок документа | ' . $year;
	$h1		= 'Главный заголовок';
	$menu = [
		[
			'url'	=> '/',
			'name'	=> 'Главная'
		],
		[
			'url'	=> '/catalog/',
			'name'	=> 'Каталог',
			'child'	=> [
				[
					'url'	=> '/catalog/catalog-1/',
					'name'	=> 'Подкаталог 1'
				],
				[
					'url'	=> '/catalog/catalog-2/',
					'name'	=> 'Подкаталог 2',
					'child'	=> [
						[
							'url'	=> 'catalog/catalog-2/favorite/',
							'name'	=> 'Лучшее'
						]
					]
				]
			]
		],
		[
			'url'	=> '/contact/',
			'name'	=> 'Контакты'
		]
	];
?>
<!DOCTYPE html>
<html lang="en">
	<head>
		<meta charset="utf-8">
		<title><?=$title;?></title>
	</head>
<body>
	<?=get_menu( $menu )?>
	<h1><?=$h1;?></h1>
	<p>Возведение в степень:  -3**3 = <?=power( -3, 3 );?></p>
	<p>Текущий время - <?=date_plural()?></p>
<?php
	$a = -1343;
	$b = 5;
	echo '<br>-----------------------------------------------<br>';
	
	
	echo $a . ' ' . $b . ' | ';

	$a = $a + $b;
	$b = $a - $b;
	$a = $a - $b;

	echo $a . ' ' . $b . ' | ';

	$a = ( ($a = $a + $b) - ($b = $a - $b) );
	
	echo $a . ' ' . $b;
	echo '<br>-----------------------------------------------<br>';
	
	
	if( 0 <= $a && 0 <= $b ){
		echo 'Разность: ' . ($a - $b);
	}elseif( 0 > $a && 0 > $b ){
		echo 'Произведение: ' . ($a * $b);
	}else{
		echo 'Сумма: ' . ($a + $b);
	}
	echo '<br>-----------------------------------------------<br>';
	
	
#	выводятся числа от 0 до 15 с включением крайних границ
#	предлоги "от" и "до" в разных случаях можно трактовать по разному
#	в остальных случаях можно использовать преинкремент, а также убирать первую и\или последнюю строку из свитча
	$a = 3;
	switch( $a ):
		case '0':	echo $a++;
		case '1':	echo $a++;
		case '2':	echo $a++;
		case '3':	echo $a++;
		case '4':	echo $a++;
		case '5':	echo $a++;
		case '6':	echo $a++;
		case '7':	echo $a++;
		case '8':	echo $a++;
		case '9':	echo $a++;
		case '10':	echo $a++;
		case '11':	echo $a++;
		case '12':	echo $a++;
		case '13':	echo $a++;
		case '14':	echo $a++;
		case '15':	echo $a++;
	endswitch;
	echo '<br>-----------------------------------------------<br>';
	

#	
#	УРОК 3	
#	
	
#	Задание 1
#	С помощью цикла while вывести все числа в промежутке от 0 до 100,
#	которые делятся на 3 без остатка.
	$i = 0;
	while( 100 >= $i ){
		if( 0 == $i%3 ){
			echo $i . ' ';
		}
		$i++;
	}
	echo '<br>-----------------------------------------------<br>';
	
	
#	Задание 2
#	С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, 
#	чтобы результат выглядел так:
#	0 – ноль.
#	1 – нечетное число.
#	2 – четное число.
#	3 – нечетное число.
#	…
#	10 – четное число.
	echo numb_list( 12 );
	echo '<br>-----------------------------------------------<br>';
	
	
#	Задание 3
#	Объявить массив, в котором в качестве ключей будут использоваться 
#	названия областей, а в качестве значений – массивы с названиями городов 
#	из соответствующей области. Вывести в цикле значения массива, чтобы 
#	результат был таким:
	$obl_citys = [
		'Московская область' => [
			'Москва',
			'Зеленоград',
			'Клин'
		],
		'Ленинградская область' => [
			'Санкт-Петербург',
			'Всеволожск',
			'Павловск',
			'Кронштадт'
		],
		'Рязанская область' => [
			'Основной город',
			'Другой город'
		]
	];
	foreach( $obl_citys as $obl => $citys ){
		echo $obl . ':<br>' . implode( ', ', $citys ) . '<br>';
	}
	echo '<br>-----------------------------------------------<br>';
	

#	Задание 4
#	Объявить массив, индексами которого являются буквы русского языка, 
#	а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, 
#	‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, 
#	‘я’ => ‘ya’).
#	Написать функцию транслитерации строк.
	echo translit( 'Вывести в цикле значения массива, чтобы результат был таким:' );
	echo '<br>-----------------------------------------------<br>';
	
	
#	Задание 5
#	Написать функцию, которая заменяет в строке пробелы на подчеркивания
#	и возвращает видоизмененную строчку.
	echo replace_space( 'Вывести  в цикле   значения массива, чтобы результат был таким:' );
	echo '<br>-----------------------------------------------<br>';
	
	
#	Задание 7
#	*Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. 
#	То есть выглядеть должно так:
#	for (…){ // здесь пусто}
	for( $i=0; $i<10; print($i++) ){}
	echo '<br>-----------------------------------------------<br>';
	
	
#	Задание 8
#	*Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
	foreach( $obl_citys as $obl => $citys ){
		$city_list = [];
		foreach( $citys as $city ){
			if( 'К' == mb_substr($city, 0, 1) ){
				$city_list[] = $city;
			}
		}
		if( $city_list ){
			echo $obl . ':<br>' . implode( ', ', $city_list ) . '<br>';
		}
	}
	echo '<br>-----------------------------------------------<br>';
	
	
#	Задание 9
#	*Объединить две ранее написанные функции в одну, которая получает строку
#	на русском языке, производит транслитерацию и замену пробелов
#	на подчеркивания (аналогичная задача решается при конструировании 
#	url-адресов на основе названия статьи в блогах).
	echo text_to_url( 'С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.' );
	echo '<br>-----------------------------------------------<br>';
	?>
</body>
</html>