<?php
#	число
	$a = 5;
#	строка
    $b = '05';

#	bool(true)
#	не строгое сравнение
#	значание автоматически приводятся к одному типу(integer)
    var_dump($a == $b);


#	int(12345)
#	принудительное приведение значения к типу integer
    var_dump((int)'012345');					
	
#	bool(false)
#	строгое сравнение
#	разные типы данных
    var_dump((float)123.0 === (int)123.0);		
	
#	bool(true)
#	строгое сравнение
#	второе значение преобразуется 0, так как оно не содержит в начале символов '.', 'e', 'E', а также чисел
    var_dump((int)0 === (int)'hello, world');
